//
//  MBTIQuestion.swift
//  Topic10914
//
//  Created by 口口口瑞 on 2023/6/13.
//

import Foundation

class MBTIQuestion
{
    let question: [String]=["你喜歡交新朋友。", "你願意嘗試新的事物。", "你容易被別人的情緒感染。", "為了以防萬一，你會想很多備用方法。", "你可以保持冷靜，去處理很緊急的事情。", "在聚會中，你更傾向更熟識的朋友互動。", "你做事喜歡有始有終。", "你是為多愁善感的人。", "你是位有條理的人，會先規劃在付諸行動。", "你對自己很嚴格。", "你喜歡跟有趣的人互動。", "你對藝術不太感興趣。", "你比較理性，面對事情會理性分析判斷，而不是靠直覺。", "你喜歡隨遇而安，而不是循規蹈矩。", "你很少擔心會不會給人留下壞的印象。", "你喜歡參加聚會類型的大型活動。", "你喜歡開放式結局。", "比起成就感，幫助到別人會讓你更快樂。", "你對很多事情都有興趣，卻不知道怎麼行動。", "你很容易擔心事情變糟。", "你不想成為領導的角色。", "你對藝術沒有興趣也沒有天份。", "如果人們再理性一點，世界會變得更好。", "你喜歡先苦後甘。", "你喜歡看別人辯論。", "你不喜歡成為大家的焦點。", "你是喜怒無常的人。", "你會對效率不如你的人失去耐心。", "你常常拖到最後才開始行動。", "你對死後會發生的事情及世界感興趣。", "你不喜歡一個人。", "當討論變得太專業時，你會失去興趣。", "你對經歷不同的人，能夠感同身受。", "你通常會在最後一刻才做決定。", "你不太質疑自己。", "社交活動可以讓你更開心更有活力。", "你喜歡去美術館或是博物館。", "你很難理解別人的感受。", "你喜歡有一份每天的待辦事項。", "你很少感到沒有安全感。", "你會避免打電話。", "你需要花很多時間去理解跟自己完全不同的觀點。", "你在社交圈中是發起聚會活動的人。", "如果計畫被打斷，你會希望盡快回到正軌。", "你會糾結過去所犯下的錯誤。", "你對人類存在的原因及意義沒有興趣。", "你很難控制自己的情緒。", "即使是對方的錯，你也會為了大局著想不讓對方難堪。", "比起規律行事，你更像是爆發性的完成事情。", "當有人給你很高的評價時，你會想知道他們多久之後會對你感到失望。", "你喜歡自己一個人工作。", "你認為思考抽象的哲學問題很浪費時間。", "比起安靜、私密的環境，你更喜歡繁忙、熙熙攘攘的環境。", "你容易察覺到對方的感受。", "你常常感到不知所措。", "你會有條理的完成事情，中間不會跳過任何步驟。", "你對有爭議的事情很感興趣。", "如果你認為別人更需要它，你會把機會讓給別人。", "如果最後一刻還沒完成事情，你還是會垂死掙扎。", "你有信心覺得事情會往自己有利的方向發展。"]
}
