//
//  WorldRank.swift
//  Topic10914
//
//  Created by Topic10914 on 2023/4/26.
//

import Foundation

struct WorldRank
{
    //MARK: Academic 2023
    let AcademicNormal: [(String, String)]=[("201-300", "中國醫藥大學"), ("201-300", "國立臺灣大學"), ("301-400", "國立成功大學"), ("401-500", "國立清華大學"), ("401-500", "國立陽明交通大學"), ("601-700", "亞洲大學"), ("601-700", "長庚大學"), ("601-700", "國立中山大學"), ("601-700", "臺北醫學大學"), ("701-800", "國立中興大學"), ("801-900", "高雄醫學大學"), ("801-900", "國立中央大學")]
    let AcademicTechnology: [(String, String)]=[("601-700", "國立臺灣科技大學"), ("701-800", "國立雲林科技大學")]
    //MARK: Center 2023
    let CenterNormal: [(String, String)]=[("102", "國立臺灣大學"), ("317", "國立陽明交通大學"), ("361", "國立成功大學"), ("423", "國立清華大學"), ("514", "中國醫藥大學"), ("590", "長庚大學"), ("616", "國立中央大學"), ("686", "臺北醫學大學"), ("738", "國立中興大學"), ("776", "高雄醫學大學"), ("847", "國立中山大學"), ("1037", "國立臺灣師範大學"), ("1077", "亞洲大學"), ("1158", "國防醫學院"), ("1213", "中山醫學大學"), ("1245", "輔仁大學"), ("1313", "中原大學"), ("1388", "國立臺灣海洋大學"), ("1469", "國立政治大學"), ("1483", "國立中正大學"), ("1489", "逢甲大學"), ("1543", "淡江大學"), ("1593", "義守大學"), ("1668", "元智大學"), ("1730", "慈濟大學"), ("1777", "國立東華大學"), ("1845", "東海大學"), ("1970", "國立嘉義大學"), ("1983", "國立聯合大學")]
    let CenterTechnology: [(String, String)]=[("805", "國立臺灣科技大學"), ("1070", "國立臺北科技大學"), ("1470", "國立高雄科技大學"), ("1933", "國立雲林科技大學")]
    //MARK: QS 2024
    let QSNormal: [(String, String)]=[("69", "國立臺灣大學"), ("217", "國立陽明交通大學"), ("228", "國立成功大學"), ("233", "國立清華大學"), ("431", "國立臺灣師範大學"), ("505", "國立中山大學"), ("567", "國立政治大學"), ("577", "臺北醫學大學"), ("611-620", "國立中央大學"), ("621-630", "長庚大學"), ("661-670", "國立中興大學"), ("901-950", "亞洲大學"), ("901-950", "國立中正大學"), ("1001-1200", "長榮大學"), ("1001-1200", "中原大學"), ("1201-1400", "逢甲大學"), ("1201-1400", "輔仁大學"), ("1201-1400", "國立東華大學"), ("1201-1400", "國立臺北大學"), ("1001-1200", "國立臺灣海洋大學"), ("1201-1400", "淡江大學"), ("1201-1400", "東海大學"), ("1201-1400", "元智大學"), ("1401+", "東吳大學")]
    let QSTechnology: [(String, String)]=[("387", "國立臺灣科技大學"), ("431", "國立臺北科技大學"), ("1201-1400", "朝陽科技大學")]
    //MARK: THE 2024
    let THENormal: [(String, String)]=[("152", "國立臺灣大學"), ("301-350", "中國醫藥大學"), ("401-500", "亞洲大學"), ("401-500", "國立清華大學"), ("401-500", "國立陽明交通大學"), ("401-500", "臺北醫學大學"), ("501-600", "國立成功大學"), ("501-600", "國立臺灣師範大學"), ("601-800", "長庚大學"), ("601-800", "國立中山大學"), ("801-1000", "高雄醫學大學"), ("1001-1200", "中原大學"), ("1001-1200", "輔仁大學"), ("1001-1200", "國立中央大學"), ("1001-1200", "國立政治大學"), ("1001-1200", "國立中興大學"), ("1201-1500", "中山醫學大學"), ("1201-1500", "逢甲大學"), ("1201-1500", "義守大學"), ("1201-1500", "國立彰化師範大學"), ("1201-1500", "國立中正大學"), ("1201-1500", "國立東華大學"), ("1201-1500", "國立臺灣海洋大學"), ("1201-1500", "淡江大學"), ("1201-1500", "東海大學"), ("1201-1500", "慈濟大學"), ("1201-1500", "元智大學"), ("1501+", "中國文化大學"), ("1501+", "銘傳大學"), ("1501+", "國立嘉義大學"), ("1501+", "國立暨南國際大學"), ("1501+", "國立宜蘭大學"), ("1501+", "國立高雄大學"), ("1501+", "國立臺北大學"), ("1501+", "國立聯合大學"), ("2001+", "臺北市立大學"), ("2001+", "國立臺東大學")]
    let THETechnology: [(String, String)]=[("401-500", "國立臺灣科技大學"), ("501-600", "國立雲林科技大學"), ("801-1000", "國立臺北科技大學"), ("1001-1200", "明志科技大學"), ("1201-1500", "長庚科技大學"), ("1201-1500", "國立勤益科技大學"), ("1201-1500", "國立高雄科技大學"), ("1501+", "朝陽科技大學"), ("1501+", "國立虎尾科技大學"), ("1501+", "國立臺中科技大學")]
    //MARK: US News
    let USNormal: [(String, String)]=[("203", "國立臺灣大學"), ("394", "國立清華大學"), ("507", "中國醫藥大學"), ("579", "國立陽明交通大學"), ("639", "國立成功大學"), ("826", "國立中央大學"), ("907", "臺北醫學大學"), ("1049", "國立中山大學"), ("1049", "國立臺灣師範大學"), ("1088", "長庚大學"), ("1208", "高雄醫學大學"), ("1233", "國立中興大學"), ("1413", "淡江大學"), ("1425", "亞洲大學"), ("1522", "國立政治大學"), ("1526", "輔仁大學"), ("1564", "中原大學"), ("1664", "逢甲大學"), ("1691", "中山醫學大學"), ("1705", "國立中正大學"), ("1735", "東海大學"), ("1750", "國立臺灣海洋大學"), ("1817", "國立東華大學"), ("1876", "義守大學"), ("1885", "元智大學"), ("1954", "國防醫學院"), ("1967", "國立嘉義大學"), ("1983", "慈濟大學"), ("1998", "馬偕醫學院")]
    let USTechnology: [(String, String)]=[("889", "國立臺灣科技大學"), ("1167", "國立臺北科技大學"), ("1617", "國立雲林科技大學"), ("1813", "國立高雄科技大學"), ("1945", "長庚科技大學"), ("1949", "明志科技大學"), ("2000+", "朝陽科技大學")]
}
